InformationRegisters/бит_СведенияОбИнвалидностиПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОбИнвалидностиПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инвалидность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерияСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИнвалидности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияСправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОбИнвалидностиПроживающих/Forms/ФормаЗаписиДополнительнаяУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФизЛицоПриОткрытии             = РегистрСведенийМенеджерЗаписи.ФизЛицо;
	ПериодПриОткрытии              = РегистрСведенийМенеджерЗаписи.Период;
	ГруппаИнвалидностиПриОткрытии  = РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности;
	ДатаВыдачиПриОткрытии 		   = РегистрСведенийМенеджерЗаписи.ДатаВыдачи;
	ИнвалидностьПриОткрытии  	   = РегистрСведенийМенеджерЗаписи.Инвалидность;
	НомерСправкиПриОткрытии		   = РегистрСведенийМенеджерЗаписи.НомерСправки;
	СерияСправкиПриОткрытии        = РегистрСведенийМенеджерЗаписи.СерияСправки;
	СрокДействияСправкиПриОткрытии = РегистрСведенийМенеджерЗаписи.СрокДействияСправки;
	
	Заголовок = Заголовок + " " + РегистрСведенийМенеджерЗаписи.ФизЛицо.Наименование;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период.
	Если РегистрСведенийМенеджерЗаписи.ФизЛицо.Пустая() Тогда
		
	    РегистрСведенийМенеджерЗаписи.ФизЛицо = ФизЛицоПриОткрытии;
		РегистрСведенийМенеджерЗаписи.Период  = ПериодПриОткрытии;
		// Выставим по умолчанию.
		РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности = "III";
		РегистрСведенийМенеджерЗаписи.Инвалидность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если поменяли дату, то тогда новая  запись.
	Если ПериодПриОткрытии <> РегистрСведенийМенеджерЗаписи.Период Тогда
		
		// Если что-то поменяли тогда запишем. 
		Если ГруппаИнвалидностиПриОткрытии <> РегистрСведенийМенеджерЗаписи.ГруппаИнвалидности ИЛИ
			ДатаВыдачиПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДатаВыдачи ИЛИ
			ИнвалидностьПриОткрытии <> РегистрСведенийМенеджерЗаписи.Инвалидность ИЛИ
			НомерСправкиПриОткрытии <> РегистрСведенийМенеджерЗаписи.НомерСправки ИЛИ
			СерияСправкиПриОткрытии <> РегистрСведенийМенеджерЗаписи.СерияСправки ИЛИ
			СрокДействияСправкиПриОткрытии <> РегистрСведенийМенеджерЗаписи.СрокДействияСправки Тогда
		
			МенеджерЗаписи = РегистрыСведений.бит_СведенияОбИнвалидностиПроживающих.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Период              = ПериодПриОткрытии;
			МенеджерЗаписи.ФизЛицо             = РегистрСведенийМенеджерЗаписи.ФизЛицо;			
			МенеджерЗаписи.ГруппаИнвалидности  = ГруппаИнвалидностиПриОткрытии;
			МенеджерЗаписи.ДатаВыдачи	       = ДатаВыдачиПриОткрытии;
			МенеджерЗаписи.Инвалидность 	   = ИнвалидностьПриОткрытии;
			МенеджерЗаписи.НомерСправки        = НомерСправкиПриОткрытии;
			МенеджерЗаписи.СерияСправки	       = СерияСправкиПриОткрытии;
			МенеджерЗаписи.СрокДействияСправки = СрокДействияСправкиПриОткрытии;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Инвалидность"), РегистрСведенийМенеджерЗаписи.ФизЛицо);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", РегистрСведенийМенеджерЗаписи.ФизЛицо);
	
	ОткрытьФорму("РегистрСведений.бит_СведенияОбИнвалидностиПроживающих.Форма.ФормаСпискаУправляемая", Новый Структура("Отбор", Отбор), ЭтаФорма);

КонецПроцедуры

#КонецОбласти
